In [1]:
import numpy as np
import pandas as pd

In [3]:
#对DataFrame的操作基本都可以应用于Series
df=pd.DataFrame(np.random.randint(0,6,size=30).reshape((5,6)),columns=['a','b','c','d','e','f'],index=['one','two','three','four','five'])
df

       a  b  c  d  e  f
one    0  2  1  0  1  3
two    2  3  2  4  1  4
three  5  2  5  2  2  0
four   0  2  5  2  2  2
five   4  3  3  3  5  5

In [4]:
#sum(默认列统计，axis=0)
df.sum()

a    11
b    12
c    16
d    11
e    11
f    14
dtype: int64

In [6]:
#行统计
df.sum(axis=1)

one       7
two      16
three    16
four     13
five     23
dtype: int64

缺失值处理（忽略和保留）(默认skipna=True,即用默认值代替，一般为0)

In [8]:
df.loc['two','b']=np.NaN
df

       a    b  c  d  e  f
one    0  2.0  1  0  1  3
two    2  NaN  2  4  1  4
three  5  2.0  5  2  2  0
four   0  2.0  5  2  2  2
five   4  3.0  3  3  5  5

In [14]:
#指定不忽略
df.sum(axis=1,skipna=False)

one       7.0
two       NaN
three    16.0
four     13.0
five     23.0
dtype: float64

In [16]:
#累计求和cumsum(同样行列都可，默认为列axis=0)
print(df)
df.cumsum()

       a    b  c  d  e  f
one    0  2.0  1  0  1  3
two    2  NaN  2  4  1  4
three  5  2.0  5  2  2  0
four   0  2.0  5  2  2  2
five   4  3.0  3  3  5  5

          a    b     c     d     e     f
one     0.0  2.0   1.0   0.0   1.0   3.0
two     2.0  NaN   3.0   4.0   2.0   7.0
three   7.0  4.0   8.0   6.0   4.0   7.0
four    7.0  6.0  13.0   8.0   6.0   9.0
five   11.0  9.0  16.0  11.0  11.0  14.0

In [17]:
#目前为止的最大值、还有cummin、还有累计乘积cumprod
df.cummax()

         a    b    c    d    e    f
one    0.0  2.0  1.0  0.0  1.0  3.0
two    2.0  NaN  2.0  4.0  1.0  4.0
three  5.0  2.0  5.0  4.0  2.0  4.0
four   5.0  2.0  5.0  4.0  2.0  4.0
five   5.0  3.0  5.0  4.0  5.0  5.0

In [18]:
#横向比较
df.cummax(axis=1)

         a    b    c    d    e    f
one    0.0  2.0  2.0  2.0  2.0  3.0
two    2.0  NaN  2.0  4.0  4.0  4.0
three  5.0  5.0  5.0  5.0  5.0  5.0
four   0.0  2.0  5.0  5.0  5.0  5.0
five   4.0  4.0  4.0  4.0  5.0  5.0

In [20]:
df.mean()

a    2.20
b    2.25
c    3.20
d    2.20
e    2.20
f    2.80
dtype: float64

In [21]:
#中位数
df.median()

a    2.0
b    2.0
c    3.0
d    2.0
e    2.0
f    3.0
dtype: float64

In [22]:
#方差
df.var()

a    5.20
b    0.25
c    3.20
d    2.20
e    2.70
f    3.70
dtype: float64

In [23]:
#标准差
df.std()

a    2.280351
b    0.500000
c    1.788854
d    1.483240
e    1.643168
f    1.923538
dtype: float64

In [27]:
#简介索引（最大最小值所在位置）（inmax/idmin）
df.idxmax()

a    three
b     five
c    three
d      two
e     five
f     five
dtype: object

In [29]:
#一阶差分
print(df)
df.diff()

       a    b  c  d  e  f
one    0  2.0  1  0  1  3
two    2  NaN  2  4  1  4
three  5  2.0  5  2  2  0
four   0  2.0  5  2  2  2
five   4  3.0  3  3  5  5

         a    b    c    d    e    f
one    NaN  NaN  NaN  NaN  NaN  NaN
two    2.0  NaN  1.0  4.0  0.0  1.0
three  3.0  NaN  3.0 -2.0  1.0 -4.0
four  -5.0  0.0  0.0  0.0  0.0  2.0
five   4.0  1.0 -2.0  1.0  3.0  3.0

In [30]:
#计算百分数变化（X=(x2-x1)/x1）
df.pct_change()

              a    b    c         d    e         f
one         NaN  NaN  NaN       NaN  NaN       NaN
two         inf  0.0  1.0       inf  0.0  0.333333
three  1.500000  0.0  1.5 -0.500000  1.0 -1.000000
four  -1.000000  0.0  0.0  0.000000  0.0       inf
five        inf  0.5 -0.4  0.500000  1.5  1.500000

In [59]:
#总体描述
df.describe()

              a     b         c        d         e         f
count  5.000000  4.00  5.000000  5.00000  5.000000  5.000000
mean   2.200000  2.25  3.200000  2.20000  2.200000  2.800000
std    2.280351  0.50  1.788854  1.48324  1.643168  1.923538
min    0.000000  2.00  1.000000  0.00000  1.000000  0.000000
25%    0.000000  2.00  2.000000  2.00000  1.000000  2.000000
50%    2.000000  2.00  3.000000  2.00000  2.000000  3.000000
75%    4.000000  2.25  5.000000  3.00000  2.000000  4.000000
max    5.000000  3.00  5.000000  4.00000  5.000000  5.000000

In [60]:
#还有相关系数corr和协方差cov

In [61]:
df

       a    b  c  d  e  f
one    0  2.0  1  0  1  3
two    2  NaN  2  4  1  4
three  5  2.0  5  2  2  0
four   0  2.0  5  2  2  2
five   4  3.0  3  3  5  5

In [65]:
s=pd.Series(np.random.randint(0,6,10))
s

0    1
1    2
2    3
3    4
4    3
5    5
6    5
7    4
8    0
9    5
dtype: int64

In [66]:
#输出不重复的值（仅适用于）
s.unique()

array([1, 2, 3, 4, 5, 0])

In [67]:
#统计出现的频次
s.value_counts()

5    3
4    2
3    2
2    1
1    1
0    1
dtype: int64

In [70]:
#统计频次并排序
pd.value_counts(s.values,sort=False)

0    1
1    1
2    1
3    2
4    2
5    3
dtype: int64

In [71]:
#查看是否在某个列表中
mask=s.isin([1,3,5])

In [72]:
mask

0     True
1    False
2     True
3    False
4     True
5     True
6     True
7    False
8    False
9     True
dtype: bool